telespial/EdgeAI_sphere_demo_NXP_FRDM-MCXN947/src/edgeai_sand_demo.c
        /* dt in Q16 seconds */
        int32_t dt_q16 = dt_fallback_q16;
        uint32_t dt_us = dt_fallback_us;
        if ((dc != 0u) && (cps != 0u))
        {
            dt_q16 = (int32_t)(((uint64_t)dc << 16) / (uint64_t)cps);
            dt_us = (uint32_t)(((uint64_t)dc * 1000000u) / (uint64_t)cps);
            if (dt_q16 <= 0) dt_q16 = dt_fallback_q16;
            if (dt_us == 0u) dt_us = dt_fallback_us;
        }

        if (dt_q16 > (int32_t)(1u << 16)) dt_q16 = (int32_t)(1u << 16);
        npu_accum_us += dt_us;
        stats_accum_us += dt_us;
        render_accum_us += dt_us;
        sim_accum_q16 += dt_q16;

        int32_t ax = (int32_t)s.x;
        int32_t ay = (int32_t)s.y;
        map_accel_xy(&ax, &ay);

        /* Faster LP so small tilts respond quickly. */
        ax_lp += (ax - ax_lp) >> 2;
        ay_lp += (ay - ay_lp) >> 2;

        /* Raw 12b is roughly ~512 counts / 1g at the current mode. Clamp to avoid crazy jumps. */
        ax_lp = clamp_i32(ax_lp, -ACCEL_MAP_DENOM * 2, ACCEL_MAP_DENOM * 2);
        ay_lp = clamp_i32(ay_lp, -ACCEL_MAP_DENOM * 2, ACCEL_MAP_DENOM * 2);

        /* Deadzone + soft response curve (arcade "marble" feel).
         * We use a small deadzone then a blended linear/cubic curve so it isn't twitchy
         * near center, but still responds strongly at larger tilts.
         */
        const int32_t deadzone = 10; /* counts */
        int32_t ax_dz = ax_lp;
        int32_t ay_dz = ay_lp;
        if (abs_i32(ax_dz) <= deadzone) ax_dz = 0;
        else ax_dz -= (ax_dz > 0) ? deadzone : -deadzone;
        if (abs_i32(ay_dz) <= deadzone) ay_dz = 0;
        else ay_dz -= (ay_dz > 0) ? deadzone : -deadzone;

        /* Normalize to Q15 ~= [-1,1] at 1g. */
        int32_t ax_n_q15 = (int32_t)(((int64_t)ax_dz << 15) / (int64_t)ACCEL_MAP_DENOM);
        int32_t ay_n_q15 = (int32_t)(((int64_t)ay_dz << 15) / (int64_t)ACCEL_MAP_DENOM);
        ax_n_q15 = clamp_i32_sym(ax_n_q15, 32767);
        ay_n_q15 = clamp_i32_sym(ay_n_q15, 32767);

        /* cubic = x^3 (Q15) */
        int32_t ax2 = (int32_t)(((int64_t)ax_n_q15 * ax_n_q15) >> 15);
        int32_t ay2 = (int32_t)(((int64_t)ay_n_q15 * ay_n_q15) >> 15);
        int32_t ax_cu_q15 = (int32_t)(((int64_t)ax2 * ax_n_q15) >> 15);
        int32_t ay_cu_q15 = (int32_t)(((int64_t)ay2 * ay_n_q15) >> 15);

        /* Blend: 35% linear + 65% cubic (alpha in Q15). */
        const int32_t alpha_q15 = 11469; /* ~0.35 */
        int32_t ax_soft_q15 = (int32_t)(((int64_t)ax_n_q15 * alpha_q15 +
                                         (int64_t)ax_cu_q15 * ((1 << 15) - alpha_q15)) >> 15);
        int32_t ay_soft_q15 = (int32_t)(((int64_t)ay_n_q15 * alpha_q15 +
                                         (int64_t)ay_cu_q15 * ((1 << 15) - alpha_q15)) >> 15);

        /* If accel read is failing, force a visible change so it doesn't look like
         * the demo is broken in a mysterious way.
         */
#if !EDGEAI_RENDER_SINGLE_BLIT
        uint16_t bg = (accel_fail > 0) ? 0x1800u /* dark red */ : 0x0000u;
#endif

        /* Physics: fixed-step integration at sim_step_q16. */
        const int32_t a_px_s2 = 4200; /* px/s^2 at ~1g (arcade, not twitchy) */
        /* soft_q15 * a_px_s2 gives Q15 px/s^2; convert to Q16 by <<1 */
        int32_t ax_a_q16 = (int32_t)(((int64_t)ax_soft_q15 * a_px_s2) << 1);
        int32_t ay_a_q16 = (int32_t)(((int64_t)ay_soft_q15 * a_px_s2) << 1);

        /* Use the max radius here so the "near" ball can't clip the screen edge. */
        const int32_t minx = BALL_R_MAX + 2;
        const int32_t miny = BALL_R_MAX + 2;
        const int32_t maxx = (LCD_W - 1) - (BALL_R_MAX + 2);
        const int32_t maxy = (LCD_H - 1) - (BALL_R_MAX + 2);

        int iter = 0;
        while ((sim_accum_q16 >= sim_step_q16) && (iter < 6))
        {
            sim_accum_q16 -= sim_step_q16;
            iter++;

            vx_q16 += (int32_t)(((int64_t)ax_a_q16 * sim_step_q16) >> 16);
            vy_q16 += (int32_t)(((int64_t)ay_a_q16 * sim_step_q16) >> 16);

            /* Damping (Q16) tuned for the fixed sim rate. */
            const int32_t damp = 65000; /* ~0.992 @ 120 Hz */
            vx_q16 = (int32_t)(((int64_t)vx_q16 * damp) >> 16);
            vy_q16 = (int32_t)(((int64_t)vy_q16 * damp) >> 16);

            x_q16 += (int32_t)(((int64_t)vx_q16 * sim_step_q16) >> 16);
            y_q16 += (int32_t)(((int64_t)vy_q16 * sim_step_q16) >> 16);

            int32_t cx_s = x_q16 >> 16;
            int32_t cy_s = y_q16 >> 16;
            if (cx_s < minx) { cx_s = minx; x_q16 = cx_s << 16; vx_q16 = -(vx_q16 * 3) / 4; }
            if (cx_s > maxx) { cx_s = maxx; x_q16 = cx_s << 16; vx_q16 = -(vx_q16 * 3) / 4; }
            if (cy_s < miny) { cy_s = miny; y_q16 = cy_s << 16; vy_q16 = -(vy_q16 * 3) / 4; }
            if (cy_s > maxy) { cy_s = maxy; y_q16 = cy_s << 16; vy_q16 = -(vy_q16 * 3) / 4; }
        }

        int32_t cx = x_q16 >> 16;
        int32_t cy = y_q16 >> 16;
        int32_t r_draw = edgeai_ball_r_for_y(cy);

        bool do_render = (render_accum_us >= render_period_us);
        if (do_render) render_accum_us = 0;

        if (do_render)
        {
            /* The trail is a ring buffer; one point is "removed" each frame when overwriting
             * the head slot. Include that removed point in the dirty rect so it is cleared,
             * otherwise stale dots can remain on-screen.
             */
            int32_t removed_tx = trail_x[trail_head];
            int32_t removed_ty = trail_y[trail_head];

            /* Update trail ring. */
            trail_x[trail_head] = (int16_t)cx;
            trail_y[trail_head] = (int16_t)cy;
            trail_head = (trail_head + 1u) % TRAIL_N;

            /* Dirty rect: cover previous and current ball + trail area. */
            int32_t minx_r = cx, miny_r = cy, maxx_r = cx, maxy_r = cy;
            for (int i = 0; i < TRAIL_N; i++)
            {
                int32_t tx = trail_x[i];
                int32_t ty = trail_y[i];
                if (tx < minx_r) minx_r = tx;
                if (ty < miny_r) miny_r = ty;
                if (tx > maxx_r) maxx_r = tx;
                if (ty > maxy_r) maxy_r = ty;
            }
            if (removed_tx < minx_r) minx_r = removed_tx;
            if (removed_ty < miny_r) miny_r = removed_ty;
            if (removed_tx > maxx_r) maxx_r = removed_tx;
            if (removed_ty > maxy_r) maxy_r = removed_ty;
            if (prev_x < minx_r) minx_r = prev_x;
            if (prev_y < miny_r) miny_r = prev_y;
            if (prev_x > maxx_r) maxx_r = prev_x;
            if (prev_y > maxy_r) maxy_r = prev_y;

            int32_t pad = BALL_R_MAX + 30;
            int32_t x0 = clamp_i32(minx_r - pad, 0, LCD_W - 1);
            int32_t y0 = clamp_i32(miny_r - pad, 0, LCD_H - 1);
            int32_t x1 = clamp_i32(maxx_r + pad, 0, LCD_W - 1);
            int32_t y1 = clamp_i32(maxy_r + pad, 0, LCD_H - 1);

